Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/teachers_and_schools/teachers_duty_of_care.html.txt.tmx
Source language: en
Languages: ga

source: Teachers duty of care
ga: Dualgais cúraim na múinteoirí

source: If a child has an accident in the school, in the schoolyard, on the way to school, on the school bus or while on a school trip, the question of whether or not the school or the teachers were negligent may arise
ga: Má tharlaíonn timpiste do pháiste sa scoil, i gclós na scoile, ar an mbealach chuig an scoil, ar an mbus scoile nó ar thuras scoile d'fhéadfadh sé go nárdófaí ceist faoi cé acu an raibh an scoil nó na múinteoirí faillíoch nó nach raibh

source: There is no simple answer to the question of when the school may be liable
ga: Níl freagra shímplí ar an gceist faoi cén uair a bhféadfadh scoil a bheith freagrach

source: Everything depends on the facts of the individual case
ga: Braitheann gach rud ar na cúinsí a bhaineann le gach cás ann féin

source: Teachers' duty of care
ga: Dualgas cúraim na múinteoirí

source: The general law of negligence provides that a person may be negligent if
ga: De réir na ndlíthe ginearálta a bhaineann le faillí, d'fhéadfadh go mbeadh duine faillíoch:

source: • He/she owes a duty of care to the person injured and
ga: • Má tá cúram air / uirthi i leith an duine atá gortaithe

source: • He/she did not carry out that duty to the legal standard required and
ga: • Munar chomhlíon sé / sí an cúram sin go dtí an caighdeán dleathúil a bhí ag teastáil

source: • The person suffered damage as a result of the failure to observe the duty of care
ga: • Má d'fhulaing an duine dochar de bharr nár comhlíonadh an dualgas cúraim

source: In any given case, the actual facts must be examined closely to see if all these elements are present
ga: I ngach cás, caithfear na cúinsí féin a scrúdú go géar len a fháil amach an bhfuil na gnéithe seo ag baint leo

source: There is no doubt that teachers owe a duty of care to students
ga: Is cinnte go bhfuil dualgas cúraim ar mhúinteoirí i leith scoláirí

source: When this duty starts, where it ends and precisely what constitutes a breach of duty are not nearly so clearcut
ga: Níl na ceisteanna seo a leanas chomh soiléir sin áfach: cén uair a dtosaíonn an dualgas, cá gcríochnaíonn sé agus céard iad na cásanna go díreach ina mbíonn sárú an dualgais i gceist

source: The following general principles apply:
ga: Seo a leanas na prionsabail ghinearálta:

source: • Teachers must take reasonable care to ensure that their students do not meet with foreseeable injury
ga: • Caithfidh múinteoirí aire chiallmhar a thabhairt chun a chinntiú nach dtarlaíonn aon ghortú a mbeadh coinne leis, dá gcuid daltaí

source: They have a duty to protect the children against foreseeable risks of personal injury or harm
ga: Tá sé de dhualgas orthu na páistí a chosaint ar aon chontúirt gortaithe pearsanta nó díobháil a mbeadh coinne leo

source: • The standard of care is that of a reasonably prudent parent
ga: • Sé an caighdeán cúraim a mbeifí ag súil leis ná an caighdeán a bheadh ag tuismitheoir stuama go leor

source: The degree of care depends on such factors as the age of the students
ga: Braitheann an méid cúram ar chúinsí ar nós aois na scoláirí

source: • There must be an effective system of supervision in operation in the school
ga: • Caithfidh córas éifeachtach maoirseachta a bheith i bhfeidhm sa scoil

source: The duty of care applies while the students are on the school premises during school opening hours
ga: Bíonn dualgas cúraim i gceist nuair a bhíonn daltaí ar áitreabh na scoile, i rith uaireanta oscailte na scoile

source: It may also apply if the students are present outside of official school hours, e.g., if they arrive early or leave late and the teacher/school has agreed to the students being present
ga: D'fhéadfadh go mbeadh sé i gceist chomh maith má bhíonn scoláirí i láthair taobh amuigh de na huaireanta oifigiúla, mar shampla má thagann siad go luath nó má fhanann siad deireanach agus gur aontaigh an múinteoir/scoil leis na daltaí a bheith i láthair

source: The same duty of care applies if a teacher voluntarily supervises children
ga: Bíonn an dualgas cúraim céanna i gceist má dhéanann múinteoir maoirseacht go deonach ar pháistí

source: Teachers are required to follow good standards and approved practice
ga: Éilítear go gcleachtfadh múinteoirí deá chaighdeán agus cleachtais mholta

source: Risky classes and activities require a greater degree of supervision
ga: Bíonn níos mó maoirseachta ag teastáil le haghaidh ranganna agus imeachtaí contúirteach

source: If goggles, protective clothing, etc., are supplied for certain activities, it is the teacher's duty to ensure that they are worn
ga: Má tá gloiní cosanta agus éadaí cosanta curtha ar fáil le haghaidh imeachtaí éagsúla, tá sé de dhualgas ar an múinteoir a chinntiú go gcaitear iad

source: Teachers are not insurers and cannot be responsible for every accident in school hours
ga: Ní árachóirí iad na múinteoirí agus ní féidir leo a bheith freagrach as gach timpiste a thárlaíonn i rith uaireanta scoile

source: The courts accept that some accidents will happen no matter how well supervision is carried out and, in such cases, the teacher/school cannot be held liable
ga: Glacann na cúirteanna leis go dtarlóidh roinnt timpistí, is cuma cé chomh maith agus a bhíonn an mhaoirseacht agus i gcásanna mar seo ní féidir a rá go bhfuil an múinteoir / scoil freagrach

source: The Board of Management is vicariously liable for the negligence of its teachers
ga: Tá an Bord Bainistíochta freagrach go hionadach as faillí a chuid múinteoirí

source: That means that the board is sued in such cases
ga: Ciallaíonn sé sin go dtógtar cúis i gcoinne an Bhoird, i gcásanna mar seo

source: The board is obliged to have comprehensive insurance cover for the school
ga: Tá dualgas ar an mBord árachas cuimsitheach a bheith ar an scoil

source: This insurance must cover public liability, negligence by staff or defects in the buildings
ga: Caithfidh an tárachas seo freagracht poiblí, faillí fóirne nó máchail ar an bhfoirgneamh a chlúdú

source: The insurance policy must be available for inspection
ga: Caithfidh an polasaí a bheith ar fáil le scrúdú

source: Some parents take out insurance to cover children against accidents at school that are not the responsibility of the school
ga: Tógann roinnt tuismitheoirí árachas amach chun a gcuid páistí a chlúdú in aghaidh timpistí ar scoil nach bhfuil an scoil freagrach astu

source: Some schools encourage parents to do this
ga: Molann cuid de na scoileanna do thuismitheoirí é seo a dhéanamh

source: This is entirely a matter of personal choice
ga: Is rogha phearsanta amach is amach í seo

source: The general health services are available to children in the normal way if they suffer an injury at school
ga: Tá fáil ag páistí ar na gnáth sheirbhísí sláinte má tharlaíonn gortú dóibh ar scoil

source: Safety standards in schools
ga: Caighdeán Sábháilteachta i scoileanna

source: Schools are obliged to abide by the usual safety rules that apply to public buildings and the normal rules that apply to employee safety at work
ga: Tá dualgas ar scoileanna clóigh leis na gnáth rialacha sábháilteachta a bhaineann le foirgnimh phoiblí agus leis na rialacha coiteanta a bhaineann le sábháilteacht fostaithe i mbun oibre

source: Schools are required to have a code of behaviour in relation to school discipline and bullying and teachers are obliged to behave in accordance with that code
ga: Tá ar scoileanna cód iompair a bheith i bhfeidhm acu maidir le disciplín scoile agus bulaíocht agus tá ar mhúinteoirí iompar i gcomhréir leis an gcód sin

source: There are specific rules and guidelines for teachers if an issue of child abuse arises
ga: Tá rialacha sonracha agus treoirlínte do mhúinteoirí ann má thagann saincheist de mhí-úsáid leanaí aníos

source: In general, teachers must be registered with the Teaching Council in order to be paid from public funds
ga: Go ginearálta, ní mór do mhúinteoirí a bheith cláraithe leis an gComhairle Mhúinteoireachta go n-íocfar iad ó chistí poiblí

source: Complaints may lead to withdrawal of registration on a temporary or permanent basis
ga: Má dhéantar gearáin, d’fhéadfaí clárúchán an mhúinteora a aistarraingt ar bhonn sealadach nó buan

source: The Teaching Council provides information about making a complaint to the Council about a registered teacher
ga: Soláthraíonn an Chomhairle Mhúinteoireachta faisnéis faoi ghearán a dhéanamh leis an gComhairle faoi mhúinteoir cláraithe

source: Unless there are good and sufficient reasons, the Teaching Council will generally not look into a complaint unless school complaint or grievance procedures have been exhausted
ga: Mura bhfuil cúiseanna maithe agus leordhóthanacha ann, is gnách nach bhfiosróidh an Chomhairle Mhúinteoireacht gearán murach go ndearnadh iarracht déileáil leis an ngearán trí na nósanna imeachta gearáin nó casaoide ar dtús

source: Good and sufficient reasons include where children or vulnerable adults are, or may be, at risk of harm
ga: Áirítear le cúiseanna maithe agus leordhóthanacha cásanna ina bhfuil nó ina bhféadfadh leanaí nó daoine fásta leochaileacha a bheith i mbaol díobhála
